Revit 2027 API
ContinuousRail.HostRailingId Property
 The id of the host Railing that contains this rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId HostRailingId { get; }
Public ReadOnly Property HostRailingId As ElementId
	Get
public:
property ElementId^ HostRailingId {
	ElementId^ get ();
}
member HostRailingId : ElementId with get
Property Value
ElementId
See Also
Reference
ContinuousRail Class
Autodesk.Revit.DB.Architecture Namespace